package ua.edu.sumdu.j2se.AndriySliahetskiy.tasks;


public interface TaskInt {

    /**
     * Конструктор Task(String title, int time), що конструює неактивну задачу, яка
     * виконується у заданий час без повторення із заданою назвою.
     *
     * Конструктор Task(String title, int start, int end, int interval), що конструює
     * неактивну задачу, яка виконується у заданому проміжку часу (і початок і кінець включно) із
     * заданим інтервалом і має задану назву.
     */

    /*
     * Методи для зчитування та встановлення назви задачі
     */
    void setTitle(String title);

    String getTitle();

    /*
     * Методи для зчитування та встановлення стану задачі: ,
     */
    boolean isActive();

    void setActive(boolean active);
    /*
     * Методи для зчитування та зміни часу виконання для задач, що не повторюються
     */
    /*
     * у разі, якщо задача повторюється метод має повертати час початку
     * повторення;
     */
    int getTime();

    /*
    * у разі, якщо задача повторювалась, вона має стати такою,
    * що не повторюється.
    */
    void setTime(int time);
    /*
     * Методи для зчитування та зміни часу виконання для задач, що повторюються:
     */
    /*
     * у разі, якщо задача не повторюється метод має повертати час
     * виконання задачі;
     */
    int getStartTime();
    /*
     * у разі, якщо задача не повторюється метод має повертати час
     * виконання задачі;
     */
    int getEndTime();
    /*
     * у разі, якщо задача не повторюється метод має
     * повертати 0;
     */
    int getRepeatInterval();
    /*
     * у разі, якщо задача не
     * повторювалася метод має стати такою, що повторюється.
     */
    void setTime(int start, int end, int interval);
    /*
     * Метод для перевірки повторюваності задачі
     */
    boolean isRepeated();
    /*
     * повертає час
     * наступного виконання задачі після вказаного часу current, якщо після вказаного часу задача не
     * виконується, то метод має повертати -1.
     */
    int nextTimeAfter(int current);

}
